package list_study;
/*

Collection : 데이터 모음집
Framework : 반제품, 기능모음집
-> 다수의 데이터를 관리(저장하고, 수정하고, 읽는)하는 기능을 제공하는 문법
-> 다수의 데이터를 관리하는 방법은 여러개 존재
-> 다수의 데이터를 관리하는 방법 - List, set, Map

  ★ List (70%) : 데이터에 순번을 부여, 중복 데이터 저장 가능 o
     set (01%) : 데이터에 순번이 없음, 중복 데이터 저장 불가능 x
     Map (29%) : 데이터에 순번이 없음, key와 value 한쌍으로 데이터 관리
	┌─────────────────────────────────────────┐
	│   ┌────┐  input.radio 생각하면됨       │
	│   │ 물 │  key = 중복x; value = 중복o; │
	│  └────┘                              │
	└─────────────────────────────────────┘

 */
public class CollectionFramworkBasicConcpt {

}
